In [1]:
# Import necessary dependencies
import pyspark
from pyspark.sql import SparkSession
from pyspark.sql.functions import monotonically_increasing_id
import pandas as pd
from sqlalchemy import create_engine
from dotenv import load_dotenv
import os
import time

In [2]:
# Initialise our spark session
spark = SparkSession.builder.appName('NugaBankETL').getOrCreate()




# spark = SparkSession.builder \
#     .appName('NugaBankETL') \
#     .config("spark.driver.memory", "8g") \
#     .config("spark.ui.port", "4041") \
#     .master("local[*]") \
#     .getOrCreate()




# spark = SparkSession.builder \
#     .appName('NugaBankETL') \
#     .config("spark.driver.memory", "8g") \
#     .master("local[*]") \
#     .getOrCreate()

In [3]:
spark

In [4]:
# Data Extraction
nuga_bank_df = spark.read.csv(r'nuga_bank_transactions.csv', header=True, inferSchema=True)

In [ ]:
nuga_bank_df.show(5)

+--------------------+------+----------------+--------------+--------------------+------------------+--------------+--------------------+--------------------+--------------------+--------------------+-------------------+------------------+--------------------+-------------+-------------+--------+-----+---------+--------------------+--------------------+------+--------------+
|    Transaction_Date|Amount|Transaction_Type| Customer_Name|    Customer_Address|     Customer_City|Customer_State|    Customer_Country|             Company|           Job_Title|               Email|       Phone_Number|Credit_Card_Number|                IBAN|Currency_Code|Random_Number|Category|Group|Is_Active|        Last_Updated|         Description|Gender|Marital_Status|
+--------------------+------+----------------+--------------+--------------------+------------------+--------------+--------------------+--------------------+--------------------+--------------------+-------------------+------------------+--------------------+-------------+-------------+--------+-----+---------+--------------------+--------------------+------+--------------+
|2024-03-23 15:38:...| 34.76|      Withdrawal|    James Neal|54912 Holmes Lodg...| West Keithborough|       Florida|                Togo|Benson, Johnson a...|                NULL|                NULL|  493.720.6609x7545|  3592901394693441|GB98RBPP090285271...|          MAD|       3167.0|       C|    Z|       No|2020-06-20 03:04:...|Yeah food anythin...| Other|      Divorced|
|2024-04-22 19:15:...|163.92|      Withdrawal|   Thomas Long| 1133 Collin Passage|        Joshuabury|   Connecticut|Lao People's Demo...|                NULL|   Food technologist|michellelynch@exa...|      (497)554-3317|              NULL|GB03KFZR339662263...|          VEF|       2122.0|       B|    Z|     NULL|2020-12-27 13:23:...|Teach edge make n...|Female|       Married|
|2024-04-12 19:46:...|386.32|      Withdrawal|Ashley Shelton|5297 Johnson Port...|       North Maria|    New Jersey|              Bhutan|       Jones-Mueller|Database administ...| ljordan@example.org|      (534)769-3072|      675983949974|GB59QYRN446730519...|          COP|       7796.0|       C|    Z|       No|2020-01-24 01:23:...|Again line face c...| Other|          NULL|
|2024-04-17 15:29:...|407.15|         Deposit| James Rosario|56955 Moore Glens...|North Michellefurt|    New Mexico|             Iceland|       Vargas-Harris|Horticultural the...|parkerjames@examp...|+1-447-900-1320x257|     4761202519057|GB74FTDO268299438...|          BWP|       6284.0|       C|    Z|      Yes|2023-09-27 03:01:...|     Bag my a drive.|  NULL|          NULL|
|2024-02-10 01:51:...|161.31|         Deposit|Miguel Leonard|262 Beck Expressw...|              NULL| West Virginia|             Eritrea|Richardson, Gonza...|   Minerals surveyor| zweaver@example.net|               NULL|   213156729655186|GB94EWRN587847592...|          SOS|       9179.0|       C|    Y|       No|2022-01-22 19:08:...|Husband find ok w...|Female|       Married|
+--------------------+------+----------------+--------------+--------------------+------------------+--------------+--------------------+--------------------+--------------------+--------------------+-------------------+------------------+--------------------+-------------+-------------+--------+-----+---------+--------------------+--------------------+------+--------------+
only showing top 5 rows

In [6]:
nuga_bank_df.printSchema()

root
 |-- Transaction_Date: timestamp (nullable = true)
 |-- Amount: double (nullable = true)
 |-- Transaction_Type: string (nullable = true)
 |-- Customer_Name: string (nullable = true)
 |-- Customer_Address: string (nullable = true)
 |-- Customer_City: string (nullable = true)
 |-- Customer_State: string (nullable = true)
 |-- Customer_Country: string (nullable = true)
 |-- Company: string (nullable = true)
 |-- Job_Title: string (nullable = true)
 |-- Email: string (nullable = true)
 |-- Phone_Number: string (nullable = true)
 |-- Credit_Card_Number: long (nullable = true)
 |-- IBAN: string (nullable = true)
 |-- Currency_Code: string (nullable = true)
 |-- Random_Number: double (nullable = true)
 |-- Category: string (nullable = true)
 |-- Group: string (nullable = true)
 |-- Is_Active: string (nullable = true)
 |-- Last_Updated: timestamp (nullable = true)
 |-- Description: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Marital_Status: string (nullable = true)

### Data Cleaning and Transformation Layer

In [ ]:
nuga_bank_df.columns

['Transaction_Date',
 'Amount',
 'Transaction_Type',
 'Customer_Name',
 'Customer_Address',
 'Customer_City',
 'Customer_State',
 'Customer_Country',
 'Company',
 'Job_Title',
 'Email',
 'Phone_Number',
 'Credit_Card_Number',
 'IBAN',
 'Currency_Code',
 'Random_Number',
 'Category',
 'Group',
 'Is_Active',
 'Last_Updated',
 'Description',
 'Gender',
 'Marital_Status']

In [8]:
# Number of Rows

num_rows = nuga_bank_df.count()

num_rows

1000000

In [9]:
# Number of Columns

num_columns = len(nuga_bank_df.columns)

num_columns

23

In [10]:
# Checking for null values

for column in nuga_bank_df.columns:
    print(column, 'Nulls', nuga_bank_df.filter(nuga_bank_df[column].isNull()).count())

Transaction_Date Nulls 0
Amount Nulls 0
Transaction_Type Nulls 0
Customer_Name Nulls 100425
Customer_Address Nulls 100087
Customer_City Nulls 100034
Customer_State Nulls 100009

Customer_Country Nulls 100672
Company Nulls 100295
Job_Title Nulls 99924
Email Nulls 100043
Phone_Number Nulls 100524
Credit_Card_Number Nulls 100085
IBAN Nulls 100300
Currency_Code Nulls 99342
Random_Number Nulls 99913
Category Nulls 100332
Group Nulls 100209
Is_Active Nulls 100259
Last_Updated Nulls 100321
Description Nulls 100403
Gender Nulls 99767
Marital_Status Nulls 99904

In [11]:
# How to fill up missing values

nuga_bank_df_clean = nuga_bank_df.fillna({
    'Customer_Name' : 'Unknown',
    'Customer_Address' : 'Unknown',
    'Customer_City' : 'Unknown',
    'Customer_State' : 'Unknown',
    'Customer_Country' : 'Unknown',
    'Company' : 'Unknown',
    'Job_Title' : 'Unknown',
    'Email' : 'Unknown',
    'Phone_Number' : 'Unknown',
    'Credit_Card_Number' : 0,
    'IBAN' : 'Unknown',
    'Currency_Code' : 'Unknown',
    'Random_Number' : 0.0,
    'Category' : 'Unknown',
    'Group' : 'Unknown',
    'Is_Active' : 'Unknown',
    'Description' : 'Unknown',
    'Gender' : 'Unknown',
    'Marital_Status' : 'Unknown'
})

# Note: We skipped Last_Updated because from the code (nuga_bank_df.printSchema()), we saw that the data type of Last_Updated was timestamp and it's difficult to clean it, its easier to just drop it.

In [ ]:
# re-Checking to confirm that all null values have been cleaned

for column in nuga_bank_df_clean.columns:
    print(column, 'Nulls', nuga_bank_df_clean.filter(nuga_bank_df_clean[column].isNull()).count())

Transaction_Date Nulls 0
Amount Nulls 0
Transaction_Type Nulls 0
Customer_Name Nulls 0
Customer_Address Nulls 0
Customer_City Nulls 0
Customer_State Nulls 0
Customer_Country Nulls 0
Company Nulls 0
Job_Title Nulls 0
Email Nulls 0
Phone_Number Nulls 0
Credit_Card_Number Nulls 0
IBAN Nulls 0
Currency_Code Nulls 0
Random_Number Nulls 0
Category Nulls 0
Group Nulls 0
Is_Active Nulls 0
Last_Updated Nulls 100321
Description Nulls 0
Gender Nulls 0
Marital_Status Nulls 0

In [13]:
# Dropping missing values in Last_Updated: To do this, you'll have to drop rows where Last_Updated is null

nuga_bank_df_clean = nuga_bank_df_clean.na.drop(subset=['Last_Updated'])

In [14]:
# re-Checking to confirm that Last_Updated have been dropped

for column in nuga_bank_df_clean.columns:
    print(column, 'Nulls', nuga_bank_df_clean.filter(nuga_bank_df_clean[column].isNull()).count())

Transaction_Date Nulls 0
Amount Nulls 0
Transaction_Type Nulls 0
Customer_Name Nulls 0
Customer_Address Nulls 0
Customer_City Nulls 0
Customer_State Nulls 0
Customer_Country Nulls 0
Company Nulls 0
Job_Title Nulls 0
Email Nulls 0
Phone_Number Nulls 0
Credit_Card_Number Nulls 0
IBAN Nulls 0
Currency_Code Nulls 0
Random_Number Nulls 0
Category Nulls 0
Group Nulls 0

Is_Active Nulls 0
Last_Updated Nulls 0
Description Nulls 0
Gender Nulls 0
Marital_Status Nulls 0

In [15]:
# Checking the total number of rows to confirm that the rows where Last_Updated was null, have been dropoped.

num_rows = nuga_bank_df_clean.count()

num_rows

899679

In [16]:
# To view the summary statistics of the data
nuga_bank_df_clean.describe().show()

+-------+------------------+----------------+-------------+--------------------+-------------+--------------+----------------+-------------+------------------+-------------------+-------------------+--------------------+--------------------+-------------+-----------------+--------+-------+---------+--------------------+-------+--------------+
|summary|            Amount|Transaction_Type|Customer_Name|    Customer_Address|Customer_City|Customer_State|Customer_Country|      Company|         Job_Title|              Email|       Phone_Number|  Credit_Card_Number|                IBAN|Currency_Code|    Random_Number|Category|  Group|Is_Active|         Description| Gender|Marital_Status|
+-------+------------------+----------------+-------------+--------------------+-------------+--------------+----------------+-------------+------------------+-------------------+-------------------+--------------------+--------------------+-------------+-----------------+--------+-------+---------+--------------------+-------+--------------+
|  count|            899679|          899679|       899679|              899679|       899679|        899679|          899679|       899679|            899679|             899679|             899679|              899679|              899679|       899679|           899679|  899679| 899679|   899679|              899679| 899679|        899679|
|   mean|505.10367708927123|            NULL|         NULL|                NULL|         NULL|          NULL|            NULL|         NULL|              NULL|               NULL|6.002851385999521E9|3.409662226750534...|                NULL|         NULL|4952.920380491264|    NULL|   NULL|     NULL|                NULL|   NULL|          NULL|
| stddev|285.79453433004744|            NULL|         NULL|                NULL|         NULL|          NULL|            NULL|         NULL|              NULL|               NULL|2.306837103861942E9|1.189655005733001...|                NULL|         NULL|2966.543401151602|    NULL|   NULL|     NULL|                NULL|   NULL|          NULL|
|    min|              10.0|         Deposit| Aaron Abbott|000 Aaron Landing...|    Aaronberg|       Alabama|     Afghanistan| Abbott Group|Academic librarian|            Unknown|      (200)201-4254|                   0|GB02AAAU191993009...|          AED|              0.0|       A|Unknown|       No|A American and to...| Female|      Divorced|
|    max|            1000.0|      Withdrawal|    Zoe Young|             Unknown|  Zunigaville|       Wyoming|        Zimbabwe|Zuniga-Wilson|      Youth worker|zzuniga@example.org|            Unknown| 4999984361512569455|             Unknown|          ZWD|           9999.0| Unknown|      Z|      Yes|Yourself young ev...|Unknown|       Unknown|
+-------+------------------+----------------+-------------+--------------------+-------------+--------------+----------------+-------------+------------------+-------------------+-------------------+--------------------+--------------------+-------------+-----------------+--------+-------+---------+--------------------+-------+--------------+

In [17]:
# Number of Columns
nuga_bank_df_clean.columns

['Transaction_Date',
 'Amount',
 'Transaction_Type',
 'Customer_Name',
 'Customer_Address',
 'Customer_City',
 'Customer_State',
 'Customer_Country',
 'Company',
 'Job_Title',
 'Email',
 'Phone_Number',
 'Credit_Card_Number',
 'IBAN',
 'Currency_Code',
 'Random_Number',
 'Category',
 'Group',
 'Is_Active',
 'Last_Updated',
 'Description',
 'Gender',
 'Marital_Status']

### Creating Tables from the data Model

In [18]:
# Transaction table
transaction = nuga_bank_df_clean.select('Transaction_Date','Amount', 'Transaction_Type')

In [ ]:
transaction.show()

+--------------------+------+----------------+
|    Transaction_Date|Amount|Transaction_Type|
+--------------------+------+----------------+
|2024-03-23 15:38:...| 34.76|      Withdrawal|
|2024-04-22 19:15:...|163.92|      Withdrawal|
|2024-04-12 19:46:...|386.32|      Withdrawal|
|2024-04-17 15:29:...|407.15|         Deposit|
|2024-02-10 01:51:...|161.31|         Deposit|
|2024-02-10 22:56:...|764.34|        Transfer|
|2024-04-07 00:07:...|734.59|         Deposit|
|2024-03-08 01:51:...|592.43|         Deposit|
|2024-02-01 12:34:...| 927.1|         Deposit|
|2024-03-22 16:46:...| 66.59|        Transfer|
|2024-04-23 13:30:...| 246.3|      Withdrawal|
|2024-01-13 01:22:...|782.32|      Withdrawal|
|2024-02-25 15:16:...|818.42|      Withdrawal|
|2024-01-01 20:55:...|352.23|      Withdrawal|
|2024-01-19 00:01:...|316.19|      Withdrawal|
|2024-04-09 14:40:...|662.26|      Withdrawal|
|2024-04-15 04:58:...|893.73|         Deposit|
|2024-04-12 14:32:...|746.22|      Withdrawal|
|2024-02-26 14:43:...|214.77|      Withdrawal|
|2024-01-17 14:50:...|726.94|      Withdrawal|
+--------------------+------+----------------+
only showing top 20 rows

In [20]:
# Creating the transaction_id column

transaction = transaction.withColumn('Transaction_id', monotonically_increasing_id())

In [ ]:
transaction.show()

+--------------------+------+----------------+--------------+
|    Transaction_Date|Amount|Transaction_Type|Transaction_id|
+--------------------+------+----------------+--------------+
|2024-03-23 15:38:...| 34.76|      Withdrawal|             0|
|2024-04-22 19:15:...|163.92|      Withdrawal|             1|
|2024-04-12 19:46:...|386.32|      Withdrawal|             2|
|2024-04-17 15:29:...|407.15|         Deposit|             3|
|2024-02-10 01:51:...|161.31|         Deposit|             4|
|2024-02-10 22:56:...|764.34|        Transfer|             5|
|2024-04-07 00:07:...|734.59|         Deposit|             6|
|2024-03-08 01:51:...|592.43|         Deposit|             7|
|2024-02-01 12:34:...| 927.1|         Deposit|             8|
|2024-03-22 16:46:...| 66.59|        Transfer|             9|
|2024-04-23 13:30:...| 246.3|      Withdrawal|            10|
|2024-01-13 01:22:...|782.32|      Withdrawal|            11|
|2024-02-25 15:16:...|818.42|      Withdrawal|            12|
|2024-01-01 20:55:...|352.23|      Withdrawal|            13|
|2024-01-19 00:01:...|316.19|      Withdrawal|            14|
|2024-04-09 14:40:...|662.26|      Withdrawal|            15|
|2024-04-15 04:58:...|893.73|         Deposit|            16|
|2024-04-12 14:32:...|746.22|      Withdrawal|            17|
|2024-02-26 14:43:...|214.77|      Withdrawal|            18|
|2024-01-17 14:50:...|726.94|      Withdrawal|            19|
+--------------------+------+----------------+--------------+
only showing top 20 rows

In [22]:
# Now lets re-arrange the columns 
transaction = transaction.select('Transaction_id', 'Transaction_Date', 'Amount', 'Transaction_Type')

In [ ]:
transaction.show()

+--------------+--------------------+------+----------------+
|Transaction_id|    Transaction_Date|Amount|Transaction_Type|
+--------------+--------------------+------+----------------+
|             0|2024-03-23 15:38:...| 34.76|      Withdrawal|
|             1|2024-04-22 19:15:...|163.92|      Withdrawal|
|             2|2024-04-12 19:46:...|386.32|      Withdrawal|
|             3|2024-04-17 15:29:...|407.15|         Deposit|
|             4|2024-02-10 01:51:...|161.31|         Deposit|
|             5|2024-02-10 22:56:...|764.34|        Transfer|
|             6|2024-04-07 00:07:...|734.59|         Deposit|
|             7|2024-03-08 01:51:...|592.43|         Deposit|
|             8|2024-02-01 12:34:...| 927.1|         Deposit|
|             9|2024-03-22 16:46:...| 66.59|        Transfer|
|            10|2024-04-23 13:30:...| 246.3|      Withdrawal|
|            11|2024-01-13 01:22:...|782.32|      Withdrawal|
|            12|2024-02-25 15:16:...|818.42|      Withdrawal|
|            13|2024-01-01 20:55:...|352.23|      Withdrawal|
|            14|2024-01-19 00:01:...|316.19|      Withdrawal|
|            15|2024-04-09 14:40:...|662.26|      Withdrawal|
|            16|2024-04-15 04:58:...|893.73|         Deposit|
|            17|2024-04-12 14:32:...|746.22|      Withdrawal|
|            18|2024-02-26 14:43:...|214.77|      Withdrawal|
|            19|2024-01-17 14:50:...|726.94|      Withdrawal|
+--------------+--------------------+------+----------------+
only showing top 20 rows

In [24]:
# Creating the Customer table
customer = nuga_bank_df_clean.select('Customer_Name', 'Customer_Address', 'Customer_City', 'Customer_State', 'Customer_Country', 'Email', 'Phone_Number')

# Creating the customer_id column
customer = customer.withColumn('Customer_id', monotonically_increasing_id())

# Now lets re-arrange the columns 
customer = customer.select('Customer_id', 'Customer_Name', 'Customer_Address', 'Customer_City', 'Customer_State', 'Customer_Country', 'Email', 'Phone_Number')

In [ ]:
customer.show()

+-----------+-----------------+--------------------+--------------------+--------------+--------------------+--------------------+-------------------+
|Customer_id|    Customer_Name|    Customer_Address|       Customer_City|Customer_State|    Customer_Country|               Email|       Phone_Number|
+-----------+-----------------+--------------------+--------------------+--------------+--------------------+--------------------+-------------------+
|          0|       James Neal|54912 Holmes Lodg...|   West Keithborough|       Florida|                Togo|             Unknown|  493.720.6609x7545|
|          1|      Thomas Long| 1133 Collin Passage|          Joshuabury|   Connecticut|Lao People's Demo...|michellelynch@exa...|      (497)554-3317|
|          2|   Ashley Shelton|5297 Johnson Port...|         North Maria|    New Jersey|              Bhutan| ljordan@example.org|      (534)769-3072|
|          3|    James Rosario|56955 Moore Glens...|  North Michellefurt|    New Mexico|             Iceland|parkerjames@examp...|+1-447-900-1320x257|
|          4|   Miguel Leonard|262 Beck Expressw...|             Unknown| West Virginia|             Eritrea| zweaver@example.net|            Unknown|
|          5|      Jesse Clark|      194 Derek Burg|        Wallacemouth|    New Mexico|             Estonia|benjaminwalker@ex...|   229-511-2530x870|
|          6|       Mark Estes|4077 James Lane A...|      Williamsonport|      Michigan|Antarctica (the t...|karenrobinson@exa...|      (840)334-1610|
|          7|       Kelly Ruiz|             Unknown|          New Lauren|       Unknown|             Unknown|  iestes@example.org| 495.430.4276x42618|
|          8|        Brad Yang|    579 Nolan Harbor|South Christopher...|  South Dakota|             Unknown|maryduran@example...|  (241)738-0972x658|
|          9|   Dalton Jimenez|4330 Christine Vista|        Port Kirsten|       Unknown|            Cameroon|             Unknown|       670-499-0309|
|         10|   Paige Sheppard|0947 Mendez Under...|          Medinastad|North Carolina|             Iceland|  eric64@example.net|            Unknown|
|         11|   Stephen Nguyen|    01696 Brown Cape|          South Mary|       Wyoming|Heard Island and ...|stewartjames@exam...|  680-460-3674x6031|
|         12|    Renee Roberts|7591 Ponce Unions...|          Amandaside| Massachusetts|            Barbados|             Unknown|       695-680-5744|
|         13|Jacqueline Thomas|172 Morse Falls A...|         Bennettbury|      Oklahoma|                Fiji|  mark84@example.com| 484.837.6166x81262|
|         14|     Joseph Pratt|71283 Thomas Port...|        Lake Michele|        Nevada|     Kyrgyz Republic|robert02@example.com| 623.219.7997x39012|
|         15|        Tara Gray|    3476 Johnny Loaf|     South Davidland|     Tennessee|               Tonga|ewilliams@example...|            Unknown|
|         16|  Dominique Lynch|   181 Gregory Ferry|           Jamesfort|         Maine|               Kenya|suzanne41@example...|       448-821-0207|
|         17|      Sarah Brown|    4645 Smith Drive|        Arellanobury|   Mississippi|             Mayotte|sullivandiane@exa...|(643)844-2202x42284|
|         18|    Michael Brown|94463 Novak Turnp...|        North Robert|       Unknown|             Somalia|elliserica@exampl...|   214-650-4477x630|
|         19|     Tamara Clark|   4902 Torres Ports|        Bridgesmouth|     Tennessee|        Turkmenistan|annerice@example.com|  (528)927-0111x373|
+-----------+-----------------+--------------------+--------------------+--------------+--------------------+--------------------+-------------------+
only showing top 20 rows

In [26]:
# Creating the employee table
employee = nuga_bank_df_clean.select('Company', 'Job_Title', 'Gender', 'Marital_Status')

# Creating the employees_id column
employee = employee.withColumn('Employee_id', monotonically_increasing_id())

# Now lets re-arrange the columns 
employee = employee.select('Employee_id', 'Company', 'Job_Title', 'Gender', 'Marital_Status')

In [ ]:
employee.show()

+-----------+--------------------+--------------------+-------+--------------+
|Employee_id|             Company|           Job_Title| Gender|Marital_Status|
+-----------+--------------------+--------------------+-------+--------------+
|          0|Benson, Johnson a...|             Unknown|  Other|      Divorced|
|          1|             Unknown|   Food technologist| Female|       Married|
|          2|       Jones-Mueller|Database administ...|  Other|       Unknown|
|          3|       Vargas-Harris|Horticultural the...|Unknown|       Unknown|
|          4|Richardson, Gonza...|   Minerals surveyor| Female|       Married|
|          5|           Smith Ltd| Seismic interpreter|  Other|       Married|
|          6|         Wade-Kelley|  Surveyor, minerals|   Male|       Unknown|
|          7|             Unknown|Medical laborator...| Female|        Single|
|          8|         Lindsey LLC|Programmer, appli...| Female|        Single|
|          9|         Carroll LLC|             Unknown|   Male|        Single|
|         10|             Unknown|     Sales executive|   Male|      Divorced|
|         11|Lynch, Hayes and ...|       Stage manager|Unknown|       Married|
|         12|           Green Ltd|Psychologist, pri...|   Male|       Unknown|
|         13|             Unknown|Designer, blown g...| Female|        Single|
|         14|     Morris-Reynolds|          Podiatrist|  Other|       Married|
|         15|         Sutton-Owen|   Financial planner|  Other|       Married|
|         16|         Brown Group|Nutritional thera...|  Other|       Married|
|         17|         Scott Group|     Games developer|  Other|       Married|
|         18|Bryant, Huffman a...|Research scientis...|  Other|       Married|
|         19|          Palmer PLC|             Unknown|   Male|      Divorced|
+-----------+--------------------+--------------------+-------+--------------+
only showing top 20 rows

In [28]:
# Creating the facts table
facts_table = nuga_bank_df_clean.join(customer, ['Customer_Name', 'Customer_Address', 'Customer_City', 'Customer_State', 'Customer_Country', 'Email', 'Phone_Number'], 'left') \
                                .join(transaction, ['Transaction_Date', 'Amount', 'Transaction_Type'], 'left') \
                                .join(employee, ['Company', 'Job_Title', 'Gender', 'Marital_Status'], 'left') \
                                .select('Customer_id', 'Transaction_id', 'Employee_id', 'Credit_Card_Number', 'IBAN', 'Currency_Code', 'Random_Number', 'Category', 'Group', 'Is_Active', 'Last_Updated', 'Description')

In [ ]:
facts_table.show()

+-----------+--------------+-----------+------------------+--------------------+-------------+-------------+--------+-------+---------+--------------------+--------------------+
|Customer_id|Transaction_id|Employee_id|Credit_Card_Number|                IBAN|Currency_Code|Random_Number|Category|  Group|Is_Active|        Last_Updated|         Description|
+-----------+--------------+-----------+------------------+--------------------+-------------+-------------+--------+-------+---------+--------------------+--------------------+
|25769803788|   25769803788|25769803788|  3524136323090715|GB83HATT453421177...|          CLP|       8888.0|       C|      Y|       No|2022-02-17 13:35:...|Thing few head de...|
|         18|            18|         18|   213112163828334|GB50TJFN039979307...|          SVC|       7382.0|       B|      Z|      Yes|2020-01-19 18:19:...|Great evening so ...|
|17179869191|   17179869191|17179869191|   180029146062238|GB17MTZS784426277...|          GIP|       5688.0|       A|Unknown|  Unknown|2021-02-23 05:57:...|Network quite sit...|
|17179869187|   17179869187|17179869187|  4200874818340943|GB38LSVV394276411...|          MYR|       3553.0|       B|      Y|       No|2020-02-06 04:27:...|             Unknown|
|17179869186|   17179869186|17179869186|   374058309755656|GB22TJLV398615170...|          CHF|       6975.0|       D|Unknown|       No|2020-01-04 09:08:...|Miss floor trip p...|
|17179869185|   17179869185|17179869185|  5294843442634660|GB58EBSY417856278...|          CZK|       4989.0|       D|      X|      Yes|2023-08-26 23:10:...|             Unknown|
| 8589934611|    8589934611| 8589934611|  4409990154098702|GB71EUPG537834141...|          BMD|       3872.0|       D|      Z|      Yes|2023-07-30 18:54:...|Color future chai...|
|         20|            20|         20|   213186454811670|GB77SPMZ984195063...|          SOS|       7610.0|       C|      X|       No|2021-04-15 13:30:...|Concern remember ...|
|          8|             8|          8|   180039947294310|GB48WNWB013807482...|          HRK|       3061.0|       B|      X|       No|2020-08-31 20:40:...|Notice paper son ...|
|         11|            11|         11|  4304956118653227|GB15VYWJ018711823...|          NIO|       2502.0|       B|      Y|      Yes|2021-04-12 20:23:...|Rest theory serve...|
|25769803781|   25769803781|25769803781|  4528940883612006|GB81QGNE734082085...|          CNY|          0.0|       C|      X|       No|2023-06-29 14:00:...|Purpose discover ...|
|25769803778|   25769803778|25769803778|  3505644604415991|GB59AZPE020114645...|          KZT|       1584.0|       B|      Y|      Yes|2020-01-02 14:35:...|Shoulder call tho...|
| 8589934593|    8589934593| 8589934593|   213123497507940|GB61RQDC156293863...|          GBP|          0.0|       B|      Z|      Yes|2023-01-29 06:25:...|    Plant very name.|
|25769803794|   25769803794|25769803794|  4594077197788971|GB41SKQC651538745...|          XOF|       6574.0| Unknown|      Z|  Unknown|2022-11-06 01:41:...|Full easy source ...|
|17179869195|   17179869195|17179869195|   374183057607683|GB06NSXT356228392...|          MNT|       6118.0|       A|Unknown|      Yes|2021-03-31 23:38:...|Leave understand ...|
|17179869192|   17179869192|17179869192|  3543850867356731|GB27GILI447824103...|      Unknown|       3296.0| Unknown|      Y|      Yes|2022-12-28 05:09:...|South memory all ...|
|17179869194|   17179869194|17179869194|  3550767243558188|GB17YLOH568566574...|          TOP|       6523.0|       D|      Y|       No|2023-07-15 09:36:...| Talk get direction.|
| 8589934603|    8589934603| 8589934603|  4430190123561392|GB92ISMX785349015...|          EUR|       6555.0| Unknown|      X|       No|2022-02-11 20:06:...|Opportunity impac...|
|17179869202|   17179869202|17179869202|                 0|GB55BHIK699558487...|          ARS|       1293.0|       C|      Z|       No|2021-02-05 13:40:...|Then former addre...|
| 8589934604|    8589934604| 8589934604|                 0|GB78TOQA276294447...|          AFN|       7408.0|       A|      X|  Unknown|2022-10-31 12:47:...|Wide indeed crime...|
+-----------+--------------+-----------+------------------+--------------------+-------------+-------------+--------+-------+---------+--------------------+--------------------+
only showing top 20 rows

In [30]:
# # Saving the dataset as a parquet file
# transaction.write.mode('overwrite').parquet(r'Dataset_in_parquet/transaction')
# customer.write.mode('overwrite').parquet(r'Dataset_in_parquet/customer')
# employee.write.mode('overwrite').parquet(r'Dataset_in_parquet/employee')
# facts_table.write.mode('overwrite').parquet(r'Dataset_in_parquet/facts_table')

In [31]:
# # Saving the dataset as a CSV file
# transaction.repartition(3).write.mode('overwrite').option('header', 'true').csv(r'Dataset_in_parquet/Dataset_in_CSV/csv/transaction')
# customer.repartition(3).write.mode('overwrite').option('header', 'true').csv(r'Dataset_in_parquet/Dataset_in_CSV/csv/customer')
# employee.repartition(3).write.mode('overwrite').option('header', 'true').csv(r'Dataset_in_parquet/Dataset_in_CSV/csv/employee')
# facts_table.repartition(3).write.mode('overwrite').option('header', 'true').csv(r'Dataset_in_parquet/Dataset_in_CSV/csv/facts_table')

In [32]:
# Convert spark df to pandas df

Transaction_table = transaction.toPandas()
Customer_table = customer.toPandas()
Employee_table = employee.toPandas()
#Facts_table = facts_table.toPandas()

In [33]:
# Limiting the data tobe converted by limiting the number of rows to be converted
# Sample_facts_table = facts_table.limit(5128419)  # Adjust the number as needed
# Sample_facts_table_pd = Sample_facts_table.toPandas()


#  The facts table seems to be too large for my PC, i tried limiting the rows like you can see above but it didn't work so i'll instead limit the columns by breaking the facts table into 3.
# They'll be Facts_table1, Facts_table2 and Facts_table3


# Creating the Facts_table1 and Facts_table2
# facts_table1 = facts_table.select('Customer_id', 'Transaction_id', 'Employee_id', 'Credit_Card_Number')
# facts_table2 = facts_table.select('Random_Number', 'Category', 'Group', 'Is_Active')
# facts_table3 = facts_table.select('IBAN', 'Currency_Code', 'Last_Updated', 'Description')

# # now that the facts table have been broken down, lets now re-run the conversion of pyspark to pandas for the now two facts table
# Facts_table1 = facts_table1.toPandas()
# Facts_table2 = facts_table2.toPandas()
# Facts_table3 = facts_table3.toPandas()


# breaking it down to 3 facts tables didn't still work. in the end what worked is reducing the columns to around 2 million from the almost 9 million it was in the original dataset.
sample_facts_table = facts_table.limit(2128419)  # Adjust the number as needed
Sample_facts_table = sample_facts_table.toPandas()

In [34]:
print(Sample_facts_table.count())
print(Sample_facts_table.columns)

Customer_id           2128419
Transaction_id        2128419
Employee_id           2128419
Credit_Card_Number    2128419
IBAN                  2128419
Currency_Code         2128419
Random_Number         2128419
Category              2128419
Group                 2128419
Is_Active             2128419
Last_Updated          2128419
Description           2128419
dtype: int64
Index(['Customer_id', 'Transaction_id', 'Employee_id', 'Credit_Card_Number',
       'IBAN', 'Currency_Code', 'Random_Number', 'Category', 'Group',
       'Is_Active', 'Last_Updated', 'Description'],
      dtype='object')

### Loading Layer

In [36]:
# Load environment variables from the .env file
load_dotenv()

db_params = {
    'username' : os.getenv('DB_USER'),
    'password' : os.getenv('PASSWORD'),
    'host' : os.getenv('HOST'),
    'port': int(os.getenv('PORT')),  # Ensure PORT is an integer
    'database' : os.getenv('DATABASE')
}

# define the database connection url
db_url = f"postgresql://{db_params['username']}:{db_params['password']}@{db_params['host']}:{db_params['port']}/{db_params['database']}"


# create the database engine with the db url specified
engine = create_engine(db_url)

# connect to postgreSQL server
with engine.connect() as connection:
    # Create table and load the data
    Transaction_table.to_sql('Transaction_table', connection, index = False, if_exists = 'replace')
    Customer_table.to_sql('Customer_table', connection, index = False, if_exists = 'replace')
    Employee_table.to_sql('Employee_table', connection, index = False, if_exists = 'replace')
    Sample_facts_table.to_sql('Sample_facts_table', connection, index = False, if_exists = 'replace')

print('Database, table and data loaded successfully')

Database, table and data loaded successfully